# Shell enhancement tools
brew "fzf"
brew "ripgrep"
brew "eza"
brew "git-delta"
brew "jq"
brew "shfmt"
brew "shellcheck"

# Development tools
brew "gh"
brew "coreutils"
brew "chezmoi"
brew "terraform"
brew "python"
cask "claude-code"

# Kubernetes tools
brew "kubectl"
brew "k9s"
brew "helm"

# Fonts for terminal (Nerd Fonts for Powerlevel10k)
cask "font-fira-code-nerd-font"
