##################################################################################
## IMPORTANT NOTICES
##
## - Node.js is now installed via Homebrew for better compatibility
##
##################################################################################

# Shell enhancement tools
brew "fzf"
brew "ripgrep"
brew "eza"
brew "git-delta"
brew "jq"
brew "shfmt"
brew "shellcheck"
brew "age"

# Development tools
brew "gh"
brew "coreutils"
brew "chezmoi"
brew "node"
brew "python"
brew "tree"
brew "uv"
brew "pre-commit"
brew "lazygit"
brew "rbw" # instead of "bitwarden-cli" (which is horribly slow)

## Use NPM instead due to auto-update mult-location issue:
## `npm install -g @anthropic-ai/claude-code`
## See: https://formulae.brew.sh/cask/claude-code
##
#cask "claude-code"

# Kubernetes tools
brew "mise"
brew "kubectl"
brew "k9s"
brew "kustomize"
brew "yq"
brew "sops"

# Fonts for terminal (Nerd Fonts for Powerlevel10k)
cask "font-fira-code-nerd-font"

{{- if eq .chezmoi.os "darwin" }}
##################################################################################
## MACOS ONLY
##################################################################################

# Terraform via HashiCorp tap (macOS only - deprecated on Linux)
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# apt-get is likely used for the `ip` CLI tool on linux
brew "iproute2mac"
{{- end }}
